# -*- coding: utf-8 -*-
"""
╨Ф╨░╨╜╨╜╤Л╨╡ ╨╛╤В╨┐╤А╨░╨▓╨╕╤В╨╡╨╗╤П ╨┤╨╗╤П ╨╖╨░╨┐╨╛╨╗╨╜╨╡╨╜╨╕╤П ╤Д╨╛╤А╨╝╤Л
"""

SENDER_DATA = {
    # ╨Я╨░╤Б╨┐╨╛╤А╤В╨╜╤Л╨╡ ╨┤╨░╨╜╨╜╤Л╨╡
    "passport_series": "1820",
    "passport_number": "657875",
    "passport_issue_date": "22.07.2020",
    
    # ╨Ь╨╡╤Б╤В╨╛ ╤А╨╛╨╢╨┤╨╡╨╜╨╕╤П
    "birth_country": "╨а╨╛╤Б╤Б╨╕╤П",
    "birth_place": "╨║╨░╨╝╤Л╤И╨╕╨╜",
    
    # ╨Ы╨╕╤З╨╜╤Л╨╡ ╨┤╨░╨╜╨╜╤Л╨╡
    "first_name": "╨Ф╨╝╨╕╤В╤А╨╕╨╣",
    "last_name": "╨Э╨╡╨┐╨╛╨║╤А╤Л╤В╤Л╨╣",
    "birth_date": "03.07.2000",
    
    # ╨Ъ╨╛╨╜╤В╨░╨║╤В╤Л
    "phone": "+79880260334",
    
    # ╨Ь╨╡╤Б╤В╨╛ ╤А╨╡╨│╨╕╤Б╤В╤А╨░╤Ж╨╕╨╕ (╨╡╤Б╨╗╨╕ ╨┐╨╛╤В╤А╨╡╨▒╤Г╨╡╤В╤Б╤П)
    "registration_country": "╨а╨╛╤Б╤Б╨╕╤П",
    "registration_place": "╨║╨░╨╝╤Л╤И╨╕╨╜"
}
